Revit 2024 API
LayerModifier.Separator Property
 The separator string that will follow this modifier in the export layer name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public string Separator { get; set; }
Visual Basic
Public Property Separator As String
	Get
	Set
Visual C++
public:
property String^ Separator {
	String^ get ();
	void set (String^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
LayerModifier Class
Autodesk.Revit.DB Namespace